# 주석 
# 파이썬에서는 #을 붙여서 나타냄
# vscode 단축키 (Ctrl + /)

print("1 + 2 =", 1 + 2) #1 + 2의 결과를 출력
print("1 - 2 =", 1 - 2) #1 - 2의 결과를 출력
print("1 * 2 =", 1 * 2) #1 * 2의 결과를 출력
print("1 / 2 =", 1 / 2) #1 / 2의 결과를 출력
print("2 ** 3 =", 2 ** 3) #2 ** 3의 결과를 출력
print("3 / 2 =", 3 / 2)
print("3 // 2 =", 3 // 2) #몫
print("3 % 2 =", 3 % 2) #나머지

# python의 연산자
# + 더하기 연산자
# - 빼기 연산자
# * 곱하기 연산자
# / 나누기 연산자
# ** 제곱 연산자
# // 정수 나누기(몫) 연산자
# % 나머지 연산자

print("안녕하세요")
print('안녕하세요')
print('여러분')
print("그는 생각했다. '생각'")
print('그녀는 말했다. "말말말"')
print("쌍따옴표 사용하기 \"")

# 이스케이프 문자
# \n 줄바꿈
# \t 탭
# \" 쌍따옴표
# \' 따옴표
print('n\n\tt')
print('''안녕하세요
반갑습니다
잘부탁드립니다
안녕히계세요''')

